DataProcessors/ИмпортЭкспортШаблоновПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИмпортЭкспортШаблоновПроцессов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИдентификаторыПоддержкиРолейИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПоддержкиРолейИсполнителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПослеВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтрицательныйРезультат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПростаяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрытый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегламентныеИнтервалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РегламентныеИнтервалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНачальногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонечногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗависитОтВремениНачала</Name>
					<Comment>Ложь - не зависит (указывается один срок), Истина - зависит (указывается два срока)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасыПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДниПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадачКуратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполненияЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредшественникиЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПоследователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПредшественника</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИмпортЭкспортШаблоновПроцессов/Forms/Форма/Ext/Form/Module.bsl
//#Область ОписаниеПеременных

//&НаСервере
//Перем ОбъектыИспользуемыеВШаблонах;
//Перем ШаблоныСтатусов;
//Перем ШаблоныЭтапов;
//Перем ШаблоныРегламентныхИнтервалов;
//Перем ШаблоныРолейИсполнителей;

//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьРегламентныеИнтервалы = ПолучитьФункциональнуюОпцию("ИспользоватьРегламентныеИнтервалы");
	
	ЗаполнитьТаблицуВыгружаемыхШаблонов();
	
	УстановитьРежимРаботыВыгрузка(ЭтотОбъект);
	
	УстановитьВидимостьРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеУстановкиРасширенияДляРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения,
		НСтр("ru = 'Рекомендуется установить расширение для работы с файлами (не обязательное действие).'"), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеУстановкиРасширенияДляРаботыСФайлами(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	РасширениеДляРаботыСФайламиПодключено = РасширениеПодключено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИмяФайлаВыгрузки",
		"Видимость", РасширениеПодключено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыгрузкаБезРасширения",
		"Видимость", НЕ РасширениеПодключено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru='Файлы XML'")+"(*.xml)|*.xml";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл для выгрузки'");
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлВыгрузкиОкончаниеВыбораФайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ РасширениеДляРаботыСФайламиПодключено Тогда
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ФайлЗагрузкиОкончаниеПомещения", ЭтотОбъект),
			АдресФайлаЗагрузки, , Истина, УникальныйИдентификатор);
	Иначе
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр = НСтр("ru='Файлы XML'")+"(*.xml)|*.xml";
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл для загрузки'");
		ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлЗагрузкиОкончаниеВыбораФайла", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкиПриИзменении(Элемент)
	Если ПустаяСтрока(ИмяФайлаЗагрузки) Тогда
		АдресФайлаЗагрузки = "";
		ДатаВыгрузкиФайла = "";
		ОчиститьТаблицыЗагружаемыхДанных();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьРежимРаботыВыгрузка(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьРолиПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов(ЭтотОбъект)
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьНеИспользуемыеПриИзменении(Элемент)
	
	ЗаполнитьТаблицуВыгружаемыхШаблонов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ВыгружаемыеШаблоны

&НаКлиенте
Процедура ВыгружаемыеШаблоныПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыгружаемыеШаблоны.ТекущиеДанные;
	
	УправлениеФлагамиДерева(ВыгружаемыеШаблоны, ТекущиеДанные);
	
	Если ТекущиеДанные.Пометка = 1 Тогда
		// При отметке шаблона необходимо также отметить связанные с ним шаблоны
		СписокШаблонов = Новый Массив;
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Родитель = Неопределено Тогда
			Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
				СписокШаблонов.Добавить(Элемент.Шаблон);
			КонецЦикла;
		Иначе
			СписокШаблонов.Добавить(ТекущиеДанные.Шаблон);
		КонецЕсли;
		
		ИсходноеКоличествоШаблонов = СписокШаблонов.Количество();
		ЗаполнитьСписокЗависимыхШаблонов(СписокШаблонов);
		
		Для Каждого ТекСтрока Из ВыгружаемыеШаблоны.ПолучитьЭлементы() Цикл
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если СписокШаблонов.Найти(ТекПодстрока.Шаблон) <> Неопределено Тогда
					ТекПодстрока.Пометка = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		УправлениеФлагамиДерева(ВыгружаемыеШаблоны);
		
		Если СписокШаблонов.Количество() > ИсходноеКоличествоШаблонов Тогда
			ТекстСообщения = НСтр("ru = 'Для выгрузки были отмечены связанные шаблоны'");
			ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
		КонецЕсли;
		
	Иначе
		// Если шаблон связан с другими, то пометку необходимо также снять у связанных шаблонов
		СписокШаблонов = Новый Массив;
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Родитель = Неопределено Тогда
			Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
				СписокШаблонов.Добавить(Элемент.Шаблон);
			КонецЦикла;
		Иначе
			СписокШаблонов.Добавить(ТекущиеДанные.Шаблон);
		КонецЕсли;
		КоличествоШаблонов = СписокШаблонов.Количество();
		ЗаполнитьСписокЗависимыхШаблонов(СписокШаблонов);
		Если СписокШаблонов.Количество() > КоличествоШаблонов Тогда
			ТекстВопроса = НСтр("ru = 'У связанных шаблонов отметки также будут сняты. Продолжить?'");
			Обработчик = Новый ОписаниеОповещения("ПослеВопросаОСнятииПометокСвязанныхШаблонов", ЭтотОбъект, СписокШаблонов);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСнятииПометокСвязанныхШаблонов(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Элементы.ВыгружаемыеШаблоны.ТекущиеДанные.Пометка = 1;
		УправлениеФлагамиДерева(ВыгружаемыеШаблоны, Элементы.ВыгружаемыеШаблоны.ТекущиеДанные);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ВыгружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ПараметрыВыполнения.Найти(ТекПодстрока.Шаблон) <> Неопределено Тогда
				ТекПодстрока.Пометка = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	УправлениеФлагамиДерева(ВыгружаемыеШаблоны);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗагружаемыеШаблоны

&НаКлиенте
Процедура ЗагружаемыеШаблоныПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗагружаемыеШаблоны.ТекущиеДанные;
	
	УправлениеФлагамиДерева(ЗагружаемыеШаблоны, ТекущиеДанные);
	
	УстановитьПометкиЗависимыхЗагружаемыхОбъектов(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	УстановитьПометки(ВыгружаемыеШаблоны, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	
	УстановитьПометки(ВыгружаемыеШаблоны, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеЗагрузка(Команда)
	
	УстановитьПометки(ЗагружаемыеШаблоны, Истина);
	
	УстановитьПометкиВсехЗагружаемыхОбъектов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеЗагрузка(Команда)
	
	УстановитьПометки(ЗагружаемыеШаблоны, Ложь);
	
	УстановитьПометкиВсехЗагружаемыхОбъектов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблоны(Команда)
	
	СписокШаблонов = Новый Массив;
	Для Каждого ТекДокумент Из ВыгружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Для Каждого ТекОперация Из ТекДокумент.ПолучитьЭлементы() Цикл
			Если ТекОперация.Пометка = 1 Тогда
				СписокШаблонов.Добавить(ТекОперация.Шаблон);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если СписокШаблонов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выберите хотя бы один шаблон для выгрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	АдресРезультата = ВыгрузитьШаблоныНаСервере(СписокШаблонов);
	
	СохранятьИнтерактивно = НЕ РасширениеДляРаботыСФайламиПодключено
		ИЛИ НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки);
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайлаВыгрузки, АдресРезультата));
	Если СохранятьИнтерактивно Тогда
		ПолучитьФайл(АдресРезультата, ИмяФайлаВыгрузки, Истина);
	Иначе
		НачатьПолучениеФайлов(Новый ОписаниеОповещения("ПослеСохраненияФайловВыгрузки", ЭтотОбъект, ИмяФайлаВыгрузки),
			МассивФайлов, ИмяФайлаВыгрузки, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблоны(Команда)
	
	Если ПустаяСтрока(АдресФайлаЗагрузки) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран файл для загрузки'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ИмяФайлаЗагрузки");
		Возврат;
	КонецЕсли;
	
	ОбъектыДляЗагрузки = Новый Структура;
	ЗагрузитьШаблоныНаСервере(ОбъектыДляЗагрузки);
	
	ТекстСообщения = НСтр("ru = 'Шаблоны успешно загружены'");
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Успешно32);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ШаблоныПроцессов"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЭтапыПроцессов"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.СтатусыДокументов"));
	Оповестить("ЗаписьНастройкиИспользованияШаблона");
	
	// Обновление таблиц с учетом только что загруженных данных
	
	ДатаВыгрузкиФайла = "";
	
	ОчиститьТаблицыЗагружаемыхДанных();
	
	ОбновитьЗагружаемыеШаблоныСервер();
	
	РазвернутьДеревоШаблонов();
	
	ЗаполнитьПометкиЗагружаемыхДанных(ОбъектыДляЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПометкиЗагружаемыхДанных(ОбъектыДляЗагрузки)
	
	Для Каждого СтрокаДокумент Из ЗагружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаШаблон Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			Если ОбъектыДляЗагрузки.ШаблоныДляЗагрузки[СтрокаШаблон.ИдентификаторПоддержки] = Неопределено Тогда
				СтрокаШаблон.Пометка = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаЭтап Из ЗагружаемыеЭтапы Цикл
		Если ОбъектыДляЗагрузки.ЭтапыДляЗагрузки[СтрокаЭтап.ИдентификаторПоддержки] = Неопределено Тогда
			СтрокаЭтап.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСтатус Из ЗагружаемыеСтатусы Цикл
		Если ОбъектыДляЗагрузки.СтатусыДляЗагрузки[СтрокаСтатус.ИдентификаторПоддержки] = Неопределено Тогда
			СтрокаСтатус.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаИнтервал Из ЗагружаемыеИнтервалы Цикл
		Если ОбъектыДляЗагрузки.ИнтервалыДляЗагрузки[СтрокаИнтервал.ИдентификаторПоддержки] = Неопределено Тогда
			СтрокаИнтервал.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаРоль Из ЗагружаемыеРоли Цикл
		Если ОбъектыДляЗагрузки.РолиДляЗагрузки[СтрокаРоль.ИдентификаторПоддержки] = Неопределено Тогда
			СтрокаРоль.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	УправлениеФлагамиДерева(ЗагружаемыеШаблоны);
	
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	ОбновитьЗагружаемыеШаблоны();
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФайловВыгрузки(МассивФайлов, ДополнительныеПараметры) Экспорт
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Файл выгрузки ""%1"" успешно сформирован'"),
					ДополнительныеПараметры);
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Успешно32);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРежимРаботыВыгрузка(Форма)

	Если Форма.Элементы.СтраницыФормы.ТекущаяСтраница = Форма.Элементы.ВыгрузкаДанных Тогда
		РежимРаботыВыгрузка = Истина;
	Иначе
		РежимРаботыВыгрузка = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВыгрузитьШаблоны",
		"Видимость", РежимРаботыВыгрузка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗагрузитьШаблоны",
		"Видимость", НЕ РежимРаботыВыгрузка);

КонецПроцедуры // УстановитьРежимРаботыВыгрузка()

&НаСервере
Функция ВыгрузитьШаблоныНаСервере(СписокШаблонов)
	
	Обработка = Обработки.ИмпортЭкспортШаблоновПроцессов.Создать();
	
	Возврат Обработка.ВыполнитьВыгрузкуДанных(СписокШаблонов);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьШаблоныНаСервере(ОбъектыДляЗагрузки)
	
	СоответствиеШаблонов = Новый Соответствие;
	ШаблоныДляЗагрузки = Новый Соответствие;
	Для Каждого СтрокаДокумент Из ЗагружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаШаблон Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			СоответствиеШаблонов.Вставить(СтрокаШаблон.ИдентификаторПоддержки, СтрокаШаблон.ШаблонВБазе);
			Если СтрокаШаблон.Пометка Тогда
				ШаблоныДляЗагрузки.Вставить(СтрокаШаблон.ИдентификаторПоддержки, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СоответствиеЭтапов = Новый Соответствие;
	ЭтапыДляЗагрузки = Новый Соответствие;
	Для Каждого СтрокаЭтап Из ЗагружаемыеЭтапы Цикл
		СоответствиеЭтапов.Вставить(СтрокаЭтап.ИдентификаторПоддержки, СтрокаЭтап.ЭтапВБазе);
		Если СтрокаЭтап.Пометка Тогда
			ЭтапыДляЗагрузки.Вставить(СтрокаЭтап.ИдентификаторПоддержки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеСтатусов = Новый Соответствие;
	СтатусыДляЗагрузки = Новый Соответствие;
	Для Каждого СтрокаСтатус Из ЗагружаемыеСтатусы Цикл
		СоответствиеСтатусов.Вставить(СтрокаСтатус.ИдентификаторПоддержки, СтрокаСтатус.СтатусВБазе);
		Если СтрокаСтатус.Пометка Тогда
			СтатусыДляЗагрузки.Вставить(СтрокаСтатус.ИдентификаторПоддержки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеИнтервалов = Новый Соответствие;
	ИнтервалыДляЗагрузки = Новый Соответствие;
	Для Каждого СтрокаИнтервал Из ЗагружаемыеИнтервалы Цикл
		СоответствиеИнтервалов.Вставить(СтрокаИнтервал.ИдентификаторПоддержки, СтрокаИнтервал.ИнтервалВБазе);
		Если СтрокаИнтервал.Пометка Тогда
			ИнтервалыДляЗагрузки.Вставить(СтрокаИнтервал.ИдентификаторПоддержки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеРолей = Новый Соответствие;
	РолиДляЗагрузки = Новый Соответствие;
	Для Каждого СтрокаРоль Из ЗагружаемыеРоли Цикл
		СоответствиеРолей.Вставить(СтрокаРоль.ИдентификаторПоддержки, СтрокаРоль.РольВБазе);
		Если СтрокаРоль.Пометка Тогда
			РолиДляЗагрузки.Вставить(СтрокаРоль.ИдентификаторПоддержки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	СоответствияОбъектов = Новый Структура;
	СоответствияОбъектов.Вставить("СоответствиеШаблонов", СоответствиеШаблонов);
	СоответствияОбъектов.Вставить("СоответствиеЭтапов", СоответствиеЭтапов);
	СоответствияОбъектов.Вставить("СоответствиеСтатусов", СоответствиеСтатусов);
	СоответствияОбъектов.Вставить("СоответствиеИнтервалов", СоответствиеИнтервалов);
	СоответствияОбъектов.Вставить("СоответствиеРолей", СоответствиеРолей);
	
	ОбъектыДляЗагрузки = Новый Структура;
	ОбъектыДляЗагрузки.Вставить("ШаблоныДляЗагрузки", ШаблоныДляЗагрузки);
	ОбъектыДляЗагрузки.Вставить("ЭтапыДляЗагрузки", ЭтапыДляЗагрузки);
	ОбъектыДляЗагрузки.Вставить("СтатусыДляЗагрузки", СтатусыДляЗагрузки);
	ОбъектыДляЗагрузки.Вставить("ИнтервалыДляЗагрузки", ИнтервалыДляЗагрузки);
	ОбъектыДляЗагрузки.Вставить("РолиДляЗагрузки", РолиДляЗагрузки);
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("АдресФайлаЗагрузки", АдресФайлаЗагрузки);
	ПараметрыЗагрузки.Вставить("СоответствияОбъектов", СоответствияОбъектов);
	ПараметрыЗагрузки.Вставить("ОбъектыДляЗагрузки", ОбъектыДляЗагрузки);
	ПараметрыЗагрузки.Вставить("ЗагружатьИсполнителей", ЗагружатьИсполнителей);
	ПараметрыЗагрузки.Вставить("ЗагружатьНастройкиИспользования", ЗагружатьНастройкиИспользования);
	ПараметрыЗагрузки.Вставить("ЗагружатьНастройкиСвойствЭлементов", ЗагружатьНастройкиСвойствЭлементов);

	Обработка = Обработки.ИмпортЭкспортШаблоновПроцессов.Создать();
	Обработка.ВыполнитьЗагрузкуДанных(ПараметрыЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВыгружаемыхШаблонов()
	
	ВыгружаемыеШаблоны.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессов.Ссылка КАК Шаблон,
	|	ШаблоныПроцессов.Описание КАК Описание,
	|	ШаблоныПроцессов.ИдентификаторДокумента.Синоним КАК Документ,
	|	ШаблоныПроцессов.НеИспользуется КАК НеИспользуется,
	|	ВЫБОР
	|		КОГДА ШаблоныПроцессов.ПометкаУдаления
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|ГДЕ
	|	ШаблоныПроцессов.НеИспользуется В(&ЗначенияНеИспользуется)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|ИТОГИ
	|	СРЕДНЕЕ(-1) КАК ИндексКартинки
	|ПО
	|	Документ";
	
	ЗначенияНеИспользуется = Новый Массив;
	Если СкрыватьНеИспользуемые Тогда
		ЗначенияНеИспользуется.Добавить(Ложь);
	Иначе	
		ЗначенияНеИспользуется.Добавить(Истина);
		ЗначенияНеИспользуется.Добавить(Ложь);
	КонецЕсли;
	
	Запрос.Параметры.Вставить("ЗначенияНеИспользуется", ЗначенияНеИспользуется);
	
	Выборка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ВыгружаемыеШаблоны.ПолучитьЭлементы(), Выборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлВыгрузкиОкончаниеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайлаВыгрузки = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиОкончаниеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайлаЗагрузки = ВыбранныеФайлы[0];
	АдресФайлаЗагрузки = "";
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ФайлЗагрузкиОкончаниеПомещения", ЭтотОбъект),
		АдресФайлаЗагрузки, ИмяФайлаЗагрузки, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДерева(Дерево, ТекущиеДанные = Неопределено)
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Для Каждого ТекСтрока Из Дерево.ПолучитьЭлементы() Цикл
			ЗначениеФлагаГруппы = Неопределено;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ЗначениеФлагаГруппы = Неопределено Тогда
					ЗначениеФлагаГруппы = ТекПодстрока.Пометка;
				ИначеЕсли ЗначениеФлагаГруппы <> ТекПодстрока.Пометка Тогда
					ЗначениеФлагаГруппы = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.Пометка = ЗначениеФлагаГруппы;
		КонецЦикла;
		
	Иначе
		
		Если ТекущиеДанные.Пометка = 2 Тогда
			ТекущиеДанные.Пометка = 0;
		КонецЕсли;
		
		ЗначениеФлага = ТекущиеДанные.Пометка;
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		// Если флаг изменен у группы, то надо аналогично изменить флаг у подчиненных элементов.
		Если Родитель = Неопределено Тогда
			Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
				Элемент.Пометка = ЗначениеФлага;
			КонецЦикла;
		Иначе
			// Если изменен флаг внутри группы, и в этой группе имеются элементы с отличными флагами, то
			// группе надо установить значение флага "Не определено" (2).
			ЗначениеФлагаГруппы = ЗначениеФлага;
			Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
				Если Элемент.Пометка <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппы = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.Пометка = ЗначениеФлагаГруппы;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(ТекДерево, ТекЗначение)
	
	Для Каждого ТекСтрока Из ТекДерево.ПолучитьЭлементы() Цикл
		ТекСтрока.Пометка = ТекЗначение;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			ТекПодстрока.Пометка = ТекЗначение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиОкончаниеПомещения(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаЗагрузки = Адрес;
	ИмяФайлаЗагрузки = ВыбранноеИмяФайла;
	
	ПродолжитьЗагрузку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузку()
	
	ДатаВыгрузкиФайла = "";
	
	ОчиститьТаблицыЗагружаемыхДанных();
	
	ОбновитьЗагружаемыеШаблоныСервер();
	
	РазвернутьДеревоШаблонов();
	
	УстановитьВидимостьРеквизитов(ЭтотОбъект);
	
	Если ЗагружаемыеШаблоны.ПолучитьЭлементы().Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Файл не содержит шаблонов для загрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗагружаемыеШаблоны()
	
	Если ПустаяСтрока(ИмяФайлаЗагрузки) ИЛИ НЕ РасширениеДляРаботыСФайламиПодключено Тогда
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ФайлЗагрузкиОкончаниеПомещения", ЭтотОбъект),
			АдресФайлаЗагрузки, , Истина, УникальныйИдентификатор);
	Иначе
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ФайлЗагрузкиОкончаниеПомещения", ЭтотОбъект),
			АдресФайлаЗагрузки, ИмяФайлаЗагрузки, Ложь, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗагружаемыеШаблоныСервер()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаЗагрузки);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	ФайлШаблонов = Новый ЧтениеXML;
	ФайлШаблонов.ОткрытьФайл(ИмяВременногоФайла);
	ФайлШаблонов.Прочитать();
	
	ЗагрузитьСписокШаблоновИзФайла(ФайлШаблонов);
	
	ФайлШаблонов.Закрыть();
	
	ПоместитьВоВременноеХранилище(ДанныеФайла, АдресФайлаЗагрузки);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Обработка не требуется. Файл будет удален платформой автоматически.
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокШаблоновИзФайла(ФайлДанных)
	
	ОбъектыИспользуемыеВШаблонах = Новый Соответствие;
	ШаблоныСтатусов = Новый Соответствие;
	ШаблоныЭтапов = Новый Соответствие;
	ШаблоныРегламентныхИнтервалов = Новый Соответствие;
	ШаблоныРолейИсполнителей = Новый Соответствие;
	
	ТипУзлаНачалоЭлемента = ТипУзлаXML.НачалоЭлемента;
	ТипУзлаКонецЭлемента = ТипУзлаXML.КонецЭлемента;
	
	ТекДокумент = "";
	ПредставлениеДокумента = "";
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "ДатаВыгрузки" Тогда
				
				ФайлДанных.Прочитать();
				ДатаВыгрузкиФайла = XMLЗначение(Тип("Дата"), ФайлДанных.Значение);
				
			ИначеЕсли ФайлДанных.Имя = "ШаблонПроцесса" Тогда
				
				НаимДок = ФайлДанных.ПолучитьАтрибут("Документ");
				Если НаимДок <> ТекДокумент Тогда
					ТекДокумент = НаимДок;
					ПредставлениеДокумента = СинонимДокументаПоИмени(ТекДокумент);
					ТекДокументДерева = ЗагружаемыеШаблоны.ПолучитьЭлементы().Добавить();
					ТекДокументДерева.Документ = ПредставлениеДокумента;
					ТекДокументДерева.Пометка = Истина;
				КонецЕсли;
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены шаблоны с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					ШаблонВБазе = Справочники.ШаблоныПроцессов.НайтиПоРеквизиту("ИдентификаторПоддержки", ИдентификаторПоддержки);
				Иначе
					ШаблонВБазе = Справочники.ШаблоныПроцессов.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				Если НЕ ЗначениеЗаполнено(Наименование) Тогда
					Наименование = НСтр("ru = '<Наименование не задано>'");
				КонецЕсли;
				
				ТекШаблонДерева = ТекДокументДерева.ПолучитьЭлементы().Добавить();
				ТекШаблонДерева.Документ = ПредставлениеДокумента;
				ТекШаблонДерева.Шаблон = Наименование;
				ТекШаблонДерева.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекШаблонДерева.ШаблонВБазе = ШаблонВБазе;
				ТекШаблонДерева.НайденОбъектВБазе = НЕ ШаблонВБазе.Пустая();
				ТекШаблонДерева.Пометка = Истина;
				
				ОбъектыИспользуемыеВШаблоне = НайтиСоздатьСоответствиеДляОбъектовШаблона(
					ОбъектыИспользуемыеВШаблонах, ИдентификаторПоддержкиСтрокой);
				
				Элемент = ФайлДанных.ПолучитьАтрибут("НачальныйСтатус");
				ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
				Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
					ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
				КонецЕсли;
				ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
				
			ИначеЕсли ФайлДанных.Имя = "Этапы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "Этапы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ЭтапСтрока" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Этап" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						ОбъектыИспользуемыеВШаблоне.ЭтапыПроцессов.Вставить(Элемент, Истина);
						Если ШаблоныЭтапов[Элемент] = Неопределено Тогда
							ШаблоныЭтапов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныЭтапов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					ИначеЕсли ИмяУзла = "Исполнитель" Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							
							Элемент = ИсполнительИзФайла;
							ОбъектыИспользуемыеВШаблоне.РолиИсполнителей.Вставить(Элемент, Истина);
							Если ШаблоныРолейИсполнителей[Элемент] = Неопределено Тогда
								ШаблоныРолейИсполнителей.Вставить(Элемент, Новый Соответствие);
							КонецЕсли;
							ШаблоныРолейИсполнителей[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ПредшественникиЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ПредшественникиЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ПредшественникиЭтапа" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "УсловиеРассмотрения" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ПрерываниеЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ПрерываниеЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ПрерываниеЭтапа" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "УсловиеРассмотрения" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ДополнительныеОбработчики" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ДополнительныеОбработчики" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ДополнительныйОбработчик" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Статус" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ВлияниеНаДругиеПроцессы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ВлияниеНаДругиеПроцессы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "Влияние" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Статус"
						ИЛИ ИмяУзла = "УстанавливаемыйСтатус" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					ИначеЕсли ИмяУзла = "ЗависимыйШаблон" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						ОбъектыИспользуемыеВШаблоне.ШаблоныПроцессов.Вставить(Элемент, Истина);
						
						ОбъектыИспользуемыеВЗависимомШаблоне = НайтиСоздатьСоответствиеДляОбъектовШаблона(
							ОбъектыИспользуемыеВШаблонах, Элемент);
						ОбъектыИспользуемыеВЗависимомШаблоне.ШаблоныПроцессов.Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ТребованияКПроведению" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ТребованияКПроведению" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ТребованиеКПроведению" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Статус" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ТребованияКВыполнению" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ТребованияКВыполнению" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ТребованиеКВыполнению" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Статус" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИнициирующиеСобытия" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИнициирующиеСобытия" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИнициирующееСобытие" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Статус" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						ОбъектыИспользуемыеВШаблоне.СтатусыДокументов.Вставить(Элемент, Истина);
						Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
							ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
						КонецЕсли;
						ШаблоныСтатусов[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИсполнителиГрупповыхЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИсполнителиГрупповыхЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИсполнительГрупповогоЭтапа" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "Исполнитель" Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							
							Элемент = ИсполнительИзФайла;
							ОбъектыИспользуемыеВШаблоне.РолиИсполнителей.Вставить(Элемент, Истина);
							Если ШаблоныРолейИсполнителей[Элемент] = Неопределено Тогда
								ШаблоныРолейИсполнителей.Вставить(Элемент, Новый Соответствие);
							КонецЕсли;
							ШаблоныРолейИсполнителей[Элемент].Вставить(ИдентификаторПоддержкиСтрокой, Истина);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ЭтапПроцесса" Тогда
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены этапы с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					ЭтапВБазе = Справочники.ЭтапыПроцессов.НайтиПоРеквизиту("ИдентификаторПоддержки", ИдентификаторПоддержки);
				Иначе
					ЭтапВБазе = Справочники.ЭтапыПроцессов.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				Если НЕ ЗначениеЗаполнено(Наименование) Тогда
					Наименование = НСтр("ru = '<Наименование не задано>'");
				КонецЕсли;
				
				ТекЭлемент = ЗагружаемыеЭтапы.Добавить();
				ТекЭлемент.Этап = Наименование;
				ТекЭлемент.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекЭлемент.ЭтапВБазе = ЭтапВБазе;
				ТекЭлемент.НайденОбъектВБазе = НЕ ЭтапВБазе.Пустая();
				ТекЭлемент.Пометка = Истина;
				
			ИначеЕсли ФайлДанных.Имя = "РезультатыВыполнения" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "РезультатыВыполнения" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "РезультатВыполнения" Тогда
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "СтатусПослеВыполнения" Тогда
						
						Элемент = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если НЕ ЗначениеЗаполнено(Элемент) Тогда
							Продолжить;
						КонецЕсли;
						
						Для Каждого ОбъектыИспользуемыеВШаблоне Из ОбъектыИспользуемыеВШаблонах Цикл
							Если ОбъектыИспользуемыеВШаблоне.Значение.ЭтапыПроцессов[ИдентификаторПоддержкиСтрокой] <> Неопределено Тогда
								ОбъектыИспользуемыеВШаблоне.Значение.СтатусыДокументов.Вставить(Элемент, Истина);
								Если ШаблоныСтатусов[Элемент] = Неопределено Тогда
									ШаблоныСтатусов.Вставить(Элемент, Новый Соответствие);
								КонецЕсли;
								ШаблоныСтатусов[Элемент].Вставить(ОбъектыИспользуемыеВШаблоне.Ключ, Истина);
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "СтатусДокумента" Тогда
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены статусы с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					СтатусВБазе = Справочники.СтатусыДокументов.НайтиПоРеквизиту("ИдентификаторПоддержки", ИдентификаторПоддержки);
				Иначе
					СтатусВБазе = Справочники.СтатусыДокументов.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				ПараметрыПоиска = Новый Структура("ИдентификаторПоддержки", ИдентификаторПоддержкиСтрокой);
				Если ЗагружаемыеСтатусы.НайтиСтроки(ПараметрыПоиска).Количество() > 0
					ИЛИ ПустаяСтрока(Наименование) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекЭлемент = ЗагружаемыеСтатусы.Добавить();
				ТекЭлемент.Статус = Наименование;
				ТекЭлемент.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекЭлемент.СтатусВБазе = СтатусВБазе;
				ТекЭлемент.НайденОбъектВБазе = НЕ СтатусВБазе.Пустая();
				ТекЭлемент.Пометка = Истина;
				
			ИначеЕсли ФайлДанных.Имя = "РегламентныйИнтервал" Тогда
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены регламентные интервалы с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					ИнтервалВБазе = Справочники.РегламентныеИнтервалы.НайтиПоРеквизиту("ИдентификаторПоддержки", ИдентификаторПоддержки);
				Иначе
					ИнтервалВБазе = Справочники.РегламентныеИнтервалы.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				Если НЕ ЗначениеЗаполнено(Наименование) Тогда
					Наименование = НСтр("ru = '<Наименование не задано>'");
				КонецЕсли;
				
				ТекЭлемент = ЗагружаемыеИнтервалы.Добавить();
				ТекЭлемент.Интервал = Наименование;
				ТекЭлемент.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекЭлемент.ИнтервалВБазе = ИнтервалВБазе;
				ТекЭлемент.НайденОбъектВБазе = НЕ ИнтервалВБазе.Пустая();
				ТекЭлемент.Пометка = Истина;
				
				Элемент = ФайлДанных.ПолучитьАтрибут("Шаблон");
				ОбъектыИспользуемыеВШаблонах[Элемент].РегламентныеИнтервалы.Вставить(ИдентификаторПоддержкиСтрокой, Истина);
				Если ШаблоныРегламентныхИнтервалов[ИдентификаторПоддержкиСтрокой] = Неопределено Тогда
					ШаблоныРегламентныхИнтервалов.Вставить(ИдентификаторПоддержкиСтрокой, Новый Соответствие);
				КонецЕсли;
				ШаблоныРегламентныхИнтервалов[ИдентификаторПоддержкиСтрокой].Вставить(Элемент, Истина);
				
			ИначеЕсли ФайлДанных.Имя = "РольИсполнителя" Тогда
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены роли исполнителей с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	РолиИсполнителей.Ссылка КАК Ссылка
					|ИЗ
					|	РегистрСведений.ИдентификаторыПоддержкиРолейИсполнителей КАК ИдентификаторыПоддержкиРолейИсполнителей
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РолиИсполнителей КАК РолиИсполнителей
					|		ПО ИдентификаторыПоддержкиРолейИсполнителей.РольИсполнителя = РолиИсполнителей.Ссылка
					|ГДЕ
					|	ИдентификаторыПоддержкиРолейИсполнителей.ИдентификаторПоддержки = &ИдентификаторПоддержки";
					Запрос.УстановитьПараметр("ИдентификаторПоддержки", ИдентификаторПоддержки);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						РольВБазе = Выборка.Ссылка;
					Иначе
						РольВБазе = Справочники.РолиИсполнителей.ПустаяСсылка();
					КонецЕсли;
				Иначе
					РольВБазе = Справочники.РолиИсполнителей.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				Если НЕ ЗначениеЗаполнено(Наименование) Тогда
					Наименование = НСтр("ru = '<Наименование не задано>'");
				КонецЕсли;
				
				ТекЭлемент = ЗагружаемыеРоли.Добавить();
				ТекЭлемент.Роль = Наименование;
				ТекЭлемент.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекЭлемент.РольВБазе = РольВБазе;
				ТекЭлемент.НайденОбъектВБазе = НЕ РольВБазе.Пустая();
				ТекЭлемент.Пометка = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектыИспользуемыеВШаблонахФикс = Новый ФиксированноеСоответствие(ОбъектыИспользуемыеВШаблонах);
	ШаблоныСтатусовФикс = Новый ФиксированноеСоответствие(ШаблоныСтатусов);
	ШаблоныЭтаповФикс = Новый ФиксированноеСоответствие(ШаблоныЭтапов);
	ШаблоныРегламентныхИнтерваловФикс = Новый ФиксированноеСоответствие(ШаблоныРегламентныхИнтервалов);
	ШаблоныРолейИсполнителейФикс = Новый ФиксированноеСоответствие(ШаблоныРолейИсполнителей);
	
КонецПроцедуры

&НаСервере
Функция НайтиСоздатьСоответствиеДляОбъектовШаблона(ОбъектыИспользуемыеВШаблонах, ИдентификаторПоддержкиСтрокой)
	
	Если ОбъектыИспользуемыеВШаблонах[ИдентификаторПоддержкиСтрокой] = Неопределено Тогда
		ОбъектыИспользуемыеВШаблоне = Новый Структура;
		ОбъектыИспользуемыеВШаблоне.Вставить("ШаблоныПроцессов", Новый Соответствие);
		ОбъектыИспользуемыеВШаблоне.Вставить("СтатусыДокументов", Новый Соответствие);
		ОбъектыИспользуемыеВШаблоне.Вставить("ЭтапыПроцессов", Новый Соответствие);
		ОбъектыИспользуемыеВШаблоне.Вставить("РегламентныеИнтервалы", Новый Соответствие);
		ОбъектыИспользуемыеВШаблоне.Вставить("РолиИсполнителей", Новый Соответствие);
		ОбъектыИспользуемыеВШаблонах.Вставить(ИдентификаторПоддержкиСтрокой, ОбъектыИспользуемыеВШаблоне);
	КонецЕсли;
	
	Возврат ОбъектыИспользуемыеВШаблонах[ИдентификаторПоддержкиСтрокой];
	
КонецФункции

&НаСервере
Функция ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных)

	ТекстовоеЗначение = "";
	Если ФайлДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ФайлДанных.Прочитать();
	КонецЕсли;
	Если ФайлДанных.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат "";
	КонецЕсли;
	ТекстовоеЗначение = ФайлДанных.Значение;
	ФайлДанных.Прочитать();
	
	Возврат ТекстовоеЗначение;

КонецФункции

&НаСервереБезКонтекста
Функция СинонимДокументаПоИмени(ИмяДокумента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Синоним
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя ПОДОБНО &ПолноеИмя";
	Запрос.УстановитьПараметр("ПолноеИмя", "Документ." + ИмяДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Синоним;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции // СинонимДокументаПоИмени()

&НаСервере
Процедура ЗаполнитьСписокЗависимыхШаблонов(СписокШаблонов)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого Шаблон Из СписокШаблонов Цикл
		ОбработкаОбъект.ПолучитьДанныеСвязанныхШаблонов(Шаблон,СписокШаблонов);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицыЗагружаемыхДанных()
	
	ЗагружаемыеШаблоны.ПолучитьЭлементы().Очистить();
	ЗагружаемыеЭтапы.Очистить();
	ЗагружаемыеСтатусы.Очистить();
	ЗагружаемыеИнтервалы.Очистить();
	ЗагружаемыеРоли.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоШаблонов()
	
	Для Каждого ТекСтрокаДокумент Из ЗагружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Элементы.ЗагружаемыеШаблоны.Развернуть(ТекСтрокаДокумент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитов(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗагружаемыеРоли", "Видимость",
		Форма.ЗагружатьИсполнителей);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗагружаемыеИнтервалы", "Видимость",
		Форма.ИспользоватьРегламентныеИнтервалы ИЛИ Форма.ЗагружаемыеИнтервалы.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВсехЗагружаемыхОбъектов(ЗначениеФлага)
	
	ШаблоныСтатусов = Новый Соответствие(ШаблоныСтатусовФикс);
	ШаблоныЭтапов = Новый Соответствие(ШаблоныЭтаповФикс);
	ШаблоныРегламентныхИнтервалов = Новый Соответствие(ШаблоныРегламентныхИнтерваловФикс);
	ШаблоныРолейИсполнителей = Новый Соответствие(ШаблоныРолейИсполнителейФикс);
	
	Если ЗначениеФлага Тогда
		Для Каждого ОбъектыИспользуемыеВШаблоне Из ОбъектыИспользуемыеВШаблонахФикс Цикл
			Шаблон = ОбъектыИспользуемыеВШаблоне.Ключ;
			Для Каждого Элемент Из ОбъектыИспользуемыеВШаблоне.Значение.СтатусыДокументов Цикл
				ШаблоныСтатусов[Элемент.Ключ].Вставить(Шаблон, Истина);
			КонецЦикла;
			Для Каждого Элемент Из ОбъектыИспользуемыеВШаблоне.Значение.ЭтапыПроцессов Цикл
				ШаблоныЭтапов[Элемент.Ключ].Вставить(Шаблон, Истина);
			КонецЦикла;
			Для Каждого Элемент Из ОбъектыИспользуемыеВШаблоне.Значение.РегламентныеИнтервалы Цикл
				ШаблоныРегламентныхИнтервалов[Элемент.Ключ].Вставить(Шаблон, Истина);
			КонецЦикла;
			Для Каждого Элемент Из ОбъектыИспользуемыеВШаблоне.Значение.РолиИсполнителей Цикл
				ШаблоныРолейИсполнителей[Элемент.Ключ].Вставить(Шаблон, Истина);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из ЗагружаемыеСтатусы Цикл
			ШаблоныСтатусов[СтрокаТаблицы.ИдентификаторПоддержки].Очистить();
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ЗагружаемыеЭтапы Цикл
			ШаблоныЭтапов[СтрокаТаблицы.ИдентификаторПоддержки].Очистить();
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ЗагружаемыеИнтервалы Цикл
			ШаблоныРегламентныхИнтервалов[СтрокаТаблицы.ИдентификаторПоддержки].Очистить();
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ЗагружаемыеРоли Цикл
			ШаблоныРолейИсполнителей[СтрокаТаблицы.ИдентификаторПоддержки].Очистить();
		КонецЦикла;
	КонецЕсли;
	
	ШаблоныСтатусовФикс = Новый ФиксированноеСоответствие(ШаблоныСтатусов);
	ШаблоныЭтаповФикс = Новый ФиксированноеСоответствие(ШаблоныЭтапов);
	ШаблоныРегламентныхИнтерваловФикс = Новый ФиксированноеСоответствие(ШаблоныРегламентныхИнтервалов);
	ШаблоныРолейИсполнителейФикс = Новый ФиксированноеСоответствие(ШаблоныРолейИсполнителей);
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеСтатусы Цикл
		СтрокаТаблицы.Пометка = ЗначениеФлага;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеЭтапы Цикл
		СтрокаТаблицы.Пометка = ЗначениеФлага;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеИнтервалы Цикл
		СтрокаТаблицы.Пометка = ЗначениеФлага;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеРоли Цикл
		СтрокаТаблицы.Пометка = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиЗависимыхЗагружаемыхОбъектов(ТекущиеДанные)
	
	ЗначениеФлага = ТекущиеДанные.Пометка;
	
	ШаблоныСтатусов = Новый Соответствие(ШаблоныСтатусовФикс);
	ШаблоныЭтапов = Новый Соответствие(ШаблоныЭтаповФикс);
	ШаблоныРегламентныхИнтервалов = Новый Соответствие(ШаблоныРегламентныхИнтерваловФикс);
	ШаблоныРолейИсполнителей = Новый Соответствие(ШаблоныРолейИсполнителейФикс);
	
	ШаблоныСоответствие = Новый Соответствие;
	ШаблоныМассив = Новый Массив;
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			ШаблоныСоответствие.Вставить(Элемент.ИдентификаторПоддержки, Истина);
			ШаблоныМассив.Добавить(Элемент.ИдентификаторПоддержки);
		КонецЦикла;
	Иначе
		ШаблоныСоответствие.Вставить(ТекущиеДанные.ИдентификаторПоддержки, Истина);
		ШаблоныМассив.Добавить(ТекущиеДанные.ИдентификаторПоддержки);
	КонецЕсли;
	
	ДобавитьЗависимыеШаблоны(ШаблоныСоответствие, ШаблоныМассив);
	
	Для Каждого ТекСтрока Из ЗагружаемыеШаблоны.ПолучитьЭлементы() Цикл
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ШаблоныСоответствие[ТекПодстрока.ИдентификаторПоддержки] <> Неопределено Тогда
				ТекПодстрока.Пометка = ЗначениеФлага;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	УправлениеФлагамиДерева(ЗагружаемыеШаблоны);
	
	Для Каждого Шаблон Из ШаблоныМассив Цикл
		Для Каждого Элемент Из ОбъектыИспользуемыеВШаблонахФикс[Шаблон].СтатусыДокументов Цикл
			Если ЗначениеФлага Тогда
				ШаблоныСтатусов[Элемент.Ключ].Вставить(Шаблон, Истина);
			Иначе
				ШаблоныСтатусов[Элемент.Ключ].Удалить(Шаблон);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из ОбъектыИспользуемыеВШаблонахФикс[Шаблон].ЭтапыПроцессов Цикл
			Если ЗначениеФлага Тогда
				ШаблоныЭтапов[Элемент.Ключ].Вставить(Шаблон, Истина);
			Иначе
				ШаблоныЭтапов[Элемент.Ключ].Удалить(Шаблон);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из ОбъектыИспользуемыеВШаблонахФикс[Шаблон].РегламентныеИнтервалы Цикл
			Если ЗначениеФлага Тогда
				ШаблоныРегламентныхИнтервалов[Элемент.Ключ].Вставить(Шаблон, Истина);
			Иначе
				ШаблоныРегламентныхИнтервалов[Элемент.Ключ].Удалить(Шаблон);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из ОбъектыИспользуемыеВШаблонахФикс[Шаблон].РолиИсполнителей Цикл
			Если ЗначениеФлага Тогда
				ШаблоныРолейИсполнителей[Элемент.Ключ].Вставить(Шаблон, Истина);
			Иначе
				ШаблоныРолейИсполнителей[Элемент.Ключ].Удалить(Шаблон);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ШаблоныСтатусовФикс = Новый ФиксированноеСоответствие(ШаблоныСтатусов);
	ШаблоныЭтаповФикс = Новый ФиксированноеСоответствие(ШаблоныЭтапов);
	ШаблоныРегламентныхИнтерваловФикс = Новый ФиксированноеСоответствие(ШаблоныРегламентныхИнтервалов);
	ШаблоныРолейИсполнителейФикс = Новый ФиксированноеСоответствие(ШаблоныРолейИсполнителей);
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеСтатусы Цикл
		СтрокаТаблицы.Пометка = ШаблоныСтатусов[СтрокаТаблицы.ИдентификаторПоддержки].Количество() > 0;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеЭтапы Цикл
		СтрокаТаблицы.Пометка = ШаблоныЭтапов[СтрокаТаблицы.ИдентификаторПоддержки].Количество() > 0;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеИнтервалы Цикл
		СтрокаТаблицы.Пометка = ШаблоныРегламентныхИнтервалов[СтрокаТаблицы.ИдентификаторПоддержки].Количество() > 0;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из ЗагружаемыеРоли Цикл
		СтрокаТаблицы.Пометка = ШаблоныРолейИсполнителей[СтрокаТаблицы.ИдентификаторПоддержки].Количество() > 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗависимыеШаблоны(ШаблоныСоответствие, ШаблоныМассив)
	
	Индекс = 0;
	Пока Индекс <= ШаблоныМассив.ВГраница() Цикл
		Шаблон = ШаблоныМассив[Индекс];
		Для Каждого СвязанныйШаблон Из ОбъектыИспользуемыеВШаблонахФикс[Шаблон].ШаблоныПроцессов Цикл
			Если ШаблоныСоответствие[СвязанныйШаблон.Ключ] = Неопределено Тогда
				ШаблоныСоответствие.Вставить(СвязанныйШаблон.Ключ, Истина);
				ШаблоныМассив.Добавить(СвязанныйШаблон.Ключ);
			КонецЕсли;
		КонецЦикла;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
